app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
    if @order.save
---
INSERT INTO "orders" ("material_id", "product_id", "created_at", "updated_at", "amount") VALUES (?, ?, ?, ?, ?)  [["material_id", 1], ["product_id", 1], ["created_at", "2017-07-05 08:55:11.563882"], ["updated_at", "2017-07-05 08:55:11.563882"], ["amount", 5]]