app/controllers/users_controller.rb

SELECT "products".* FROM "products" WHERE (user_id = 1)
---
  def index
    @products_user = Product.where('user_id = ?', current_user.id)