app/views/products/edit.html.erb

      <div class="text-center">
        <% product.orders.each do |order| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."product_id" = ?  [["product_id", 1]]

        <%= form_for(Order.new) do |o| %>
        <%= o.collection_select(:material_id,  Material.all, :id, :name) %>
---
SELECT "materials".* FROM "materials"